1
Give the number of convolution layers
4
Give the size of each convolution filter
2
Give the number of convolution filters per layer
32
Give the number of epochs
100
Give the batch size
86
---TRYING TO RUN THE AUTOENCODER WITH THE FOLLOWING PARAMETERS: 
conv_layers  4    conv_filter_size:  2    n_conv_filters_per_layer:  32    epochs:  100    batch_size:  86
enc1a
enc2a
enc3a
dec0a
0 128.0
dec1a
1 64.0
Model: "functional_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
enc0a (Conv2D)               (None, 28, 28, 32)        160       
_________________________________________________________________
batch_normalization_44 (Batc (None, 28, 28, 32)        128       
_________________________________________________________________
enc0b (Conv2D)               (None, 28, 28, 32)        4128      
_________________________________________________________________
batch_normalization_45 (Batc (None, 28, 28, 32)        128       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 14, 14, 32)        0         
_________________________________________________________________
enc_dropout1 (Dropout)       (None, 14, 14, 32)        0         
_________________________________________________________________
enc1a (Conv2D)               (None, 14, 14, 64)        8256      
_________________________________________________________________
batch_normalization_46 (Batc (None, 14, 14, 64)        256       
_________________________________________________________________
enc1b (Conv2D)               (None, 14, 14, 64)        16448     
_________________________________________________________________
batch_normalization_47 (Batc (None, 14, 14, 64)        256       
_________________________________________________________________
enc1c (MaxPooling2D)         (None, 7, 7, 64)          0         
_________________________________________________________________
enc_dropout2 (Dropout)       (None, 7, 7, 64)          0         
_________________________________________________________________
enc2a (Conv2D)               (None, 7, 7, 128)         32896     
_________________________________________________________________
batch_normalization_48 (Batc (None, 7, 7, 128)         512       
_________________________________________________________________
enc2b (Conv2D)               (None, 7, 7, 128)         65664     
_________________________________________________________________
batch_normalization_49 (Batc (None, 7, 7, 128)         512       
_________________________________________________________________
enc3a (Conv2D)               (None, 7, 7, 256)         131328    
_________________________________________________________________
batch_normalization_50 (Batc (None, 7, 7, 256)         1024      
_________________________________________________________________
enc3b (Conv2D)               (None, 7, 7, 256)         262400    
_________________________________________________________________
batch_normalization_51 (Batc (None, 7, 7, 256)         1024      
_________________________________________________________________
enc_dropout (Dropout)        (None, 7, 7, 256)         0         
_________________________________________________________________
dec0a (Conv2D)               (None, 7, 7, 128)         131200    
_________________________________________________________________
batch_normalization_52 (Batc (None, 7, 7, 128)         512       
_________________________________________________________________
dec0b (Conv2D)               (None, 7, 7, 128)         65664     
_________________________________________________________________
batch_normalization_53 (Batc (None, 7, 7, 128)         512       
_________________________________________________________________
dec1a (Conv2D)               (None, 7, 7, 64)          32832     
_________________________________________________________________
batch_normalization_54 (Batc (None, 7, 7, 64)          256       
_________________________________________________________________
dec1b (Conv2D)               (None, 7, 7, 64)          16448     
_________________________________________________________________
batch_normalization_55 (Batc (None, 7, 7, 64)          256       
_________________________________________________________________
dec_last_1 (UpSampling2D)    (None, 14, 14, 64)        0         
_________________________________________________________________
dec_last_2 (Conv2D)          (None, 14, 14, 32)        8224      
_________________________________________________________________
batch_normalization_56 (Batc (None, 14, 14, 32)        128       
_________________________________________________________________
dec_last_3 (Conv2D)          (None, 14, 14, 32)        4128      
_________________________________________________________________
batch_normalization_57 (Batc (None, 14, 14, 32)        128       
_________________________________________________________________
dec_last_4 (UpSampling2D)    (None, 28, 28, 32)        0         
_________________________________________________________________
dec_last_5 (Conv2D)          (None, 28, 28, 1)         129       
=================================================================
Total params: 785,537
Trainable params: 782,721
Non-trainable params: 2,816