Experiment completed! Choose one of the following options to procced: 
 							1 - Repeat the expirement with different hyperparameters
 							2 - Print the plots gathered from the expirement
 							3 - Save the model and exit
1
Give the number of convolution layers
3
Give the size of each convolution filter
3
Give the number of convolution filters per layer
86
Give the number of epochs
25
Give the batch size
32
---TRYING TO RUN THE AUTOENCODER WITH THE FOLLOWING PARAMETERS: 
conv_layers  3    conv_filter_size:  3    n_conv_filters_per_layer:  86    epochs:  25    batch_size:  32
enc1a
enc2a
dec0a
0 172.0
Model: "functional_13"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
enc0a (Conv2D)               (None, 28, 28, 86)        860       
_________________________________________________________________
batch_normalization_92 (Batc (None, 28, 28, 86)        344       
_________________________________________________________________
enc0b (Conv2D)               (None, 28, 28, 86)        66650     
_________________________________________________________________
batch_normalization_93 (Batc (None, 28, 28, 86)        344       
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 14, 14, 86)        0         
_________________________________________________________________
enc_dropout1 (Dropout)       (None, 14, 14, 86)        0         
_________________________________________________________________
enc1a (Conv2D)               (None, 14, 14, 172)       133300    
_________________________________________________________________
batch_normalization_94 (Batc (None, 14, 14, 172)       688       
_________________________________________________________________
enc1b (Conv2D)               (None, 14, 14, 172)       266428    
_________________________________________________________________
batch_normalization_95 (Batc (None, 14, 14, 172)       688       
_________________________________________________________________
enc1c (MaxPooling2D)         (None, 7, 7, 172)         0         
_________________________________________________________________
enc_dropout2 (Dropout)       (None, 7, 7, 172)         0         
_________________________________________________________________
enc2a (Conv2D)               (None, 7, 7, 344)         532856    
_________________________________________________________________
batch_normalization_96 (Batc (None, 7, 7, 344)         1376      
_________________________________________________________________
enc2b (Conv2D)               (None, 7, 7, 344)         1065368   
_________________________________________________________________
batch_normalization_97 (Batc (None, 7, 7, 344)         1376      
_________________________________________________________________
enc_dropout (Dropout)        (None, 7, 7, 344)         0         
_________________________________________________________________
dec0a (Conv2D)               (None, 7, 7, 172)         532684    
_________________________________________________________________
batch_normalization_98 (Batc (None, 7, 7, 172)         688       
_________________________________________________________________
dec0b (Conv2D)               (None, 7, 7, 172)         266428    
_________________________________________________________________
batch_normalization_99 (Batc (None, 7, 7, 172)         688       
_________________________________________________________________
dec_last_1 (UpSampling2D)    (None, 14, 14, 172)       0         
_________________________________________________________________
dec_last_2 (Conv2D)          (None, 14, 14, 86)        133214    
_________________________________________________________________
batch_normalization_100 (Bat (None, 14, 14, 86)        344       
_________________________________________________________________
dec_last_3 (Conv2D)          (None, 14, 14, 86)        66650     
_________________________________________________________________
batch_normalization_101 (Bat (None, 14, 14, 86)        344       
_________________________________________________________________
dec_last_4 (UpSampling2D)    (None, 28, 28, 86)        0         
_________________________________________________________________
dec_last_5 (Conv2D)          (None, 28, 28, 1)         775       
=================================================================
Total params: 3,072,093
Trainable params: 3,068,653
Non-trainable params: 3,440