Give the number of convolution layers
4
Give the size of each convolution filter
3
Give the number of convolution filters per layer
32
Give the number of epochs
100
Give the batch size
86
---TRYING TO RUN THE AUTOENCODER WITH THE FOLLOWING PARAMETERS: 
conv_layers  4    conv_filter_size:  3    n_conv_filters_per_layer:  32    epochs:  100    batch_size:  86
enc1a
enc2a
enc3a
dec0a
0 128.0
dec1a
1 64.0
Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
enc0a (Conv2D)               (None, 28, 28, 32)        320       
_________________________________________________________________
batch_normalization (BatchNo (None, 28, 28, 32)        128       
_________________________________________________________________
enc0b (Conv2D)               (None, 28, 28, 32)        9248      
_________________________________________________________________
batch_normalization_1 (Batch (None, 28, 28, 32)        128       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 32)        0         
_________________________________________________________________
enc_dropout1 (Dropout)       (None, 14, 14, 32)        0         
_________________________________________________________________
enc1a (Conv2D)               (None, 14, 14, 64)        18496     
_________________________________________________________________
batch_normalization_2 (Batch (None, 14, 14, 64)        256       
_________________________________________________________________
enc1b (Conv2D)               (None, 14, 14, 64)        36928     
_________________________________________________________________
batch_normalization_3 (Batch (None, 14, 14, 64)        256       
_________________________________________________________________
enc1c (MaxPooling2D)         (None, 7, 7, 64)          0         
_________________________________________________________________
enc_dropout2 (Dropout)       (None, 7, 7, 64)          0         
_________________________________________________________________
enc2a (Conv2D)               (None, 7, 7, 128)         73856     
_________________________________________________________________
batch_normalization_4 (Batch (None, 7, 7, 128)         512       
_________________________________________________________________
enc2b (Conv2D)               (None, 7, 7, 128)         147584    
_________________________________________________________________
batch_normalization_5 (Batch (None, 7, 7, 128)         512       
_________________________________________________________________
enc3a (Conv2D)               (None, 7, 7, 256)         295168    
_________________________________________________________________
batch_normalization_6 (Batch (None, 7, 7, 256)         1024      
_________________________________________________________________
enc3b (Conv2D)               (None, 7, 7, 256)         590080    
_________________________________________________________________
batch_normalization_7 (Batch (None, 7, 7, 256)         1024      
_________________________________________________________________
enc_dropout (Dropout)        (None, 7, 7, 256)         0         
_________________________________________________________________
dec0a (Conv2D)               (None, 7, 7, 128)         295040    
_________________________________________________________________
batch_normalization_8 (Batch (None, 7, 7, 128)         512       
_________________________________________________________________
dec0b (Conv2D)               (None, 7, 7, 128)         147584    
_________________________________________________________________
batch_normalization_9 (Batch (None, 7, 7, 128)         512       
_________________________________________________________________
dec1a (Conv2D)               (None, 7, 7, 64)          73792     
_________________________________________________________________
batch_normalization_10 (Batc (None, 7, 7, 64)          256       
_________________________________________________________________
dec1b (Conv2D)               (None, 7, 7, 64)          36928     
_________________________________________________________________
batch_normalization_11 (Batc (None, 7, 7, 64)          256       
_________________________________________________________________
dec_last_1 (UpSampling2D)    (None, 14, 14, 64)        0         
_________________________________________________________________
dec_last_2 (Conv2D)          (None, 14, 14, 32)        18464     
_________________________________________________________________
batch_normalization_12 (Batc (None, 14, 14, 32)        128       
_________________________________________________________________
dec_last_3 (Conv2D)          (None, 14, 14, 32)        9248      
_________________________________________________________________
batch_normalization_13 (Batc (None, 14, 14, 32)        128       
_________________________________________________________________
dec_last_4 (UpSampling2D)    (None, 28, 28, 32)        0         
_________________________________________________________________
dec_last_5 (Conv2D)          (None, 28, 28, 1)         289       
=================================================================
Total params: 1,758,657
Trainable params: 1,755,841
Non-trainable params: 2,816