Experiment completed! Choose one of the following options to procced: 
 							1 - Repeat the expirement with different hyperparameters
 							2 - Print the plots gathered from the expirement
 							3 - Save the model and exit
1
Give the number of convolution layers
3
Give the size of each convolution filter
3
Give the number of convolution filters per layer
64
Give the number of epochs
30
Give the batch size
64
---TRYING TO RUN THE AUTOENCODER WITH THE FOLLOWING PARAMETERS: 
conv_layers  3    conv_filter_size:  3    n_conv_filters_per_layer:  64    epochs:  30    batch_size:  64
enc1a
enc2a
dec0a
0 128.0
Model: "functional_11"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
enc0a (Conv2D)               (None, 28, 28, 64)        640       
_________________________________________________________________
batch_normalization_82 (Batc (None, 28, 28, 64)        256       
_________________________________________________________________
enc0b (Conv2D)               (None, 28, 28, 64)        36928     
_________________________________________________________________
batch_normalization_83 (Batc (None, 28, 28, 64)        256       
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 14, 14, 64)        0         
_________________________________________________________________
enc_dropout1 (Dropout)       (None, 14, 14, 64)        0         
_________________________________________________________________
enc1a (Conv2D)               (None, 14, 14, 128)       73856     
_________________________________________________________________
batch_normalization_84 (Batc (None, 14, 14, 128)       512       
_________________________________________________________________
enc1b (Conv2D)               (None, 14, 14, 128)       147584    
_________________________________________________________________
batch_normalization_85 (Batc (None, 14, 14, 128)       512       
_________________________________________________________________
enc1c (MaxPooling2D)         (None, 7, 7, 128)         0         
_________________________________________________________________
enc_dropout2 (Dropout)       (None, 7, 7, 128)         0         
_________________________________________________________________
enc2a (Conv2D)               (None, 7, 7, 256)         295168    
_________________________________________________________________
batch_normalization_86 (Batc (None, 7, 7, 256)         1024      
_________________________________________________________________
enc2b (Conv2D)               (None, 7, 7, 256)         590080    
_________________________________________________________________
batch_normalization_87 (Batc (None, 7, 7, 256)         1024      
_________________________________________________________________
enc_dropout (Dropout)        (None, 7, 7, 256)         0         
_________________________________________________________________
dec0a (Conv2D)               (None, 7, 7, 128)         295040    
_________________________________________________________________
batch_normalization_88 (Batc (None, 7, 7, 128)         512       
_________________________________________________________________
dec0b (Conv2D)               (None, 7, 7, 128)         147584    
_________________________________________________________________
batch_normalization_89 (Batc (None, 7, 7, 128)         512       
_________________________________________________________________
dec_last_1 (UpSampling2D)    (None, 14, 14, 128)       0         
_________________________________________________________________
dec_last_2 (Conv2D)          (None, 14, 14, 64)        73792     
_________________________________________________________________
batch_normalization_90 (Batc (None, 14, 14, 64)        256       
_________________________________________________________________
dec_last_3 (Conv2D)          (None, 14, 14, 64)        36928     
_________________________________________________________________
batch_normalization_91 (Batc (None, 14, 14, 64)        256       
_________________________________________________________________
dec_last_4 (UpSampling2D)    (None, 28, 28, 64)        0         
_________________________________________________________________
dec_last_5 (Conv2D)          (None, 28, 28, 1)         577       
=================================================================
Total params: 1,703,297
Trainable params: 1,700,737
Non-trainable params: 2,560