Experiment completed! Choose one of the following options to procced: 
 							1 - Repeat the expirement with different hyperparameters
 							2 - Print the plots gathered from the expirement
 							3 - Save the model and exit
1
Give the number of convolution layers
3
Give the size of each convolution filter
3
Give the number of convolution filters per layer
16
Give the number of epochs
50
Give the batch size
128
---TRYING TO RUN THE AUTOENCODER WITH THE FOLLOWING PARAMETERS: 
conv_layers  3    conv_filter_size:  3    n_conv_filters_per_layer:  16    epochs:  50    batch_size:  128
enc1a
enc2a
dec0a
0 32.0
Model: "functional_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
enc0a (Conv2D)               (None, 28, 28, 16)        160       
_________________________________________________________________
batch_normalization_72 (Batc (None, 28, 28, 16)        64        
_________________________________________________________________
enc0b (Conv2D)               (None, 28, 28, 16)        2320      
_________________________________________________________________
batch_normalization_73 (Batc (None, 28, 28, 16)        64        
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 14, 14, 16)        0         
_________________________________________________________________
enc_dropout1 (Dropout)       (None, 14, 14, 16)        0         
_________________________________________________________________
enc1a (Conv2D)               (None, 14, 14, 32)        4640      
_________________________________________________________________
batch_normalization_74 (Batc (None, 14, 14, 32)        128       
_________________________________________________________________
enc1b (Conv2D)               (None, 14, 14, 32)        9248      
_________________________________________________________________
batch_normalization_75 (Batc (None, 14, 14, 32)        128       
_________________________________________________________________
enc1c (MaxPooling2D)         (None, 7, 7, 32)          0         
_________________________________________________________________
enc_dropout2 (Dropout)       (None, 7, 7, 32)          0         
_________________________________________________________________
enc2a (Conv2D)               (None, 7, 7, 64)          18496     
_________________________________________________________________
batch_normalization_76 (Batc (None, 7, 7, 64)          256       
_________________________________________________________________
enc2b (Conv2D)               (None, 7, 7, 64)          36928     
_________________________________________________________________
batch_normalization_77 (Batc (None, 7, 7, 64)          256       
_________________________________________________________________
enc_dropout (Dropout)        (None, 7, 7, 64)          0         
_________________________________________________________________
dec0a (Conv2D)               (None, 7, 7, 32)          18464     
_________________________________________________________________
batch_normalization_78 (Batc (None, 7, 7, 32)          128       
_________________________________________________________________
dec0b (Conv2D)               (None, 7, 7, 32)          9248      
_________________________________________________________________
batch_normalization_79 (Batc (None, 7, 7, 32)          128       
_________________________________________________________________
dec_last_1 (UpSampling2D)    (None, 14, 14, 32)        0         
_________________________________________________________________
dec_last_2 (Conv2D)          (None, 14, 14, 16)        4624      
_________________________________________________________________
batch_normalization_80 (Batc (None, 14, 14, 16)        64        
_________________________________________________________________
dec_last_3 (Conv2D)          (None, 14, 14, 16)        2320      
_________________________________________________________________
batch_normalization_81 (Batc (None, 14, 14, 16)        64        
_________________________________________________________________
dec_last_4 (UpSampling2D)    (None, 28, 28, 16)        0         
_________________________________________________________________
dec_last_5 (Conv2D)          (None, 28, 28, 1)         145       
=================================================================
Total params: 107,873
Trainable params: 107,233
Non-trainable params: 640